Revit 2015 API
BoundaryConditions.Point Property
 If successful, returns the point represents Boundary Conditions.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public XYZ Point { get; }
Visual Basic
Public ReadOnly Property Point As XYZ
	Get
Visual C++
public:
property XYZ^ Point {
	XYZ^ get ();
}
Remarks
 Returns the point if the BoundaryConditions is BoundaryConditionsType::Point type. Otherwise exception is thrown.
See Also
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace